In [1]:
import pandas as pd

# Sample data
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Emma"],
    "Age": [25, 30, 35, 28, 32],
    "City": ["London", "New York", "Paris", "Paris", "Sydney"],
    "Salary": [60000, 75000, 80000, 70000, 65000],
}

employees = pd.DataFrame(data)
employees

      Name  Age      City  Salary
0    Alice   25    London   60000
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
3    David   28     Paris   70000
4     Emma   32    Sydney   65000

In [12]:
print("2 last users, Name and Salary")
employees.loc[3:4, ['Name','Salary']]
# print(employees.loc[3:4, ['Name', 'Salary']])  # Using index labels for rows and column names

    Name  Salary
3  David   70000
4   Emma   65000

In [18]:
print("Users 1 and 2 all collums")
employees.iloc[0:2, 0:3]

Users 1 and 2 all collums

    Name  Age      City
0  Alice   25    London
1    Bob   30  New York

In [30]:
print("Employees above 30")
employees[employees['Age'] > 30]

Employees above 30

      Name  Age    City  Salary
2  Charlie   35   Paris   80000
4     Emma   32  Sydney   65000